{
  "frontmatter": {
    "type": "method",
    "interface": "IView",
    "member": "IGetArcs4",
    "returns": "System.Double",
    "parameters": [],
    "docset": "sldworksapi",
    "deprecated": false,
    "since_version": "unknown",
    "categories": [
      "drawings",
      "ui"
    ],
    "related": [
      "IView.GetArcs4"
    ],
    "keywords": [
      "view",
      "see",
      "also",
      "iview",
      "arcs",
      "drawing",
      "views",
      "igetarcs4",
      "arcs4",
      "double"
    ]
  },
  "title": "IView.IGetArcs4",
  "description": "Gets all of the information for all of the arcs added by a user in this drawing view. }}-->",
  "signature": "System.Double IGetArcs4()",
  "parameters": [],
  "returns": "in-process, unmanaged C++: Pointer to an array of doubles (see Remarks ) VBA, VB.NET, C#, and C++/CLI: Not supported See In-process Methods for details about this type of method.",
  "remarks": "This method only returns arcs that were sketched by a user in a drawing view. Use\nIView::GetPolylines6\nor\nIView::IGetPolylines6\nto access the solid model's projected display data in the drawing view.\nReturn value is an array of doubles with the format:\n[\nColor, LineType, LineStyleIndex, LineWidth, LayerID, LayerOverride, StartPt[3], EndPt[3], CenterPt[3], RotDir, ...\n]\nwhere:\nColor\n- COLORREF returned as an integer. Return value could be 0 or -1 for default color.\nLineType\n- Line type. Valid returns as defined in\nswLineTypes_e\n. A\nLineType\nis a combination of a line style and line weight.\nLineStyleIndex\n- Line style. Valid line styles as defined in\nswLineStyles_e\nenumeration.\nLineWidth\n- Integer value defining the line width. Valid width values as defined in\nswLineWeights_e\n.\nLayerID\n- Integer value indicating which layer holds this entity. The\nILayer\nobject can be obtained by passing this integer value to\nILayerMgr::GetLayerById\nor\nILayerMgr::IGetLayerById\n.\nLayerOverride\n- Integer with bit flags set to determine which properties, if any, have been overridden with respect to the Layer default properties. If the bit value is set, then the specific property or properties have been overridden. The bit indicators are: color = 0x1, style = 0x2, and width = 0x4. Therefore, if\nLayerOverride\nwas returned as 3, the color and style have been specifically set for this item and may not match the default values associated with this item's layer.\nStartPt[3]\n- An array of 3 doubles (X,Y,Z) describing the start point.\nEndPt[3]\n- An array of 3 doubles (X,Y,Z) describing the end point. If the arc is closed, then\nEndPt[3]\nis the same point as the StartPt.\nCenterPt[3]\n- An array of 3 doubles (X,Y,Z) describing the center point.\nRotDir\n- Rotational direction (CW = -1, CCW = 1)\n...\nThis set of data repeats for each arc in the View. The size of the array is (NumArcs * 16). To determine the number of arcs, use\nIView::GetArcCount\n.\nThe data returned from this method is in terms of view space. If you want the data in terms of sheet space (for example, the 0,0 origin being the lower-left corner of the sheet), then you should combine this data with the three return values from\nIView::GetXForm\nor\nIView::IGetXForm\n.\nThe sheet must be visible. See\nISheet::SheetFormatVisible\n.",
  "examples": [],
  "related": [
    "IView.GetArcs4"
  ]
}