{
  "frontmatter": {
    "type": "method",
    "interface": "IView",
    "member": "IGetSplines3",
    "returns": "System.Double",
    "parameters": [],
    "docset": "sldworksapi",
    "deprecated": false,
    "since_version": "unknown",
    "categories": [
      "drawings",
      "ui"
    ],
    "related": [
      "IView.GetSplines3"
    ],
    "keywords": [
      "splines",
      "drawing",
      "views",
      "see",
      "also",
      "iview",
      "view",
      "igetsplines3",
      "splines3",
      "double"
    ]
  },
  "title": "IView.IGetSplines3",
  "description": "Gets all of the splines added by a user in the drawing view.",
  "signature": "System.Double IGetSplines3()",
  "parameters": [],
  "returns": "in-process, unmanaged C++: Pointer to an array of doubles (see Remarks ) VBA, VB.NET, C#, and C++/CLI: Not supported See In-process Methods for details about this type of method.",
  "remarks": "This method only returns splines that were sketched by a user in this drawing view. Use\nIView::GetPolylines6\nor\nIView::IGetPolylines6\nto access the solid model's projected display data in the drawing view.\nFormat of return values is an array of doubles with the format:\n[ [\nColor, LineType, LineStyleIndex, LineWidth, LayerID, LayerOverride, NumSplinePoints, [x,y,z] ]\n]\nColor\n= COLORREF returned as an integer. Return value could be 0 or -1 for default color.\nLineType\n= line type. Valid returns as defined in\nswLineTypes_e\n. A lineType is a combination of a lineStyle and lineWeight.\nLineStyleIndex\n= line style. Valid line styles as defined in\nswLineStyles_e\n.\nLineWidth\n= integer value defining the line width. Valid width values as defined in\nswLineWeights_e\n.\nLayerID\n= integer value indicating which layer holds this entity. Obtain the\nILayer\nobject by passing this integer value to\nILayerMgr::GetLayerById\nor\nILayerMgr::IGetLayerById\n.\nLayerOverride\n= integer with bit flags set to determine which properties, if any, have been overridden with respect to the Layer default properties. If the bit value is set, then the specific property or properties have been overridden. The bit indicators are: color = 0x1, style = 0x2, and width = 0x4. Therefore, if\nLayerOverride\nwas returned as 3, you know the color and style have been specifically set for this item and may not match the default values associated with this item's layer.\nThis complete set of data repeats itself for each spline found in the view. For each spline, the array returned contains the color, line type, number of spline points in the spline, and X,Y,Z value for each of those points. Therefore, the\n[x,y,z]\nparameter is an array of\nNumSplinePoints,\nwhich can vary in size from spline to spline.\nThe\n[x,y,z]\npoints for each spline are not the same as the points used to generate the spline. This method tessellates the spline based on the display quality and place points along the spline appropriately.\nThe data returned from this method is in terms of view space. If you want the data in terms of sheet space (for example, the 0,0 origin being the lower-left corner of the sheet), then combine this data with the three return values from\nIView::GetXForm\nor\nIView::IGetXForm\n.\nTo determine data size needed in this method, use\nIView::GetSplineCount\nor get the number of elements in the array returned by this method.\nIf you are using COM, then this method must be preceded by a call to IView::GetSplineCount to determine memory allocation and to perform the actual gathering of spline data.\nThe sheet must be visible. See\nISheet::SheetFormatVisible\n.",
  "examples": [],
  "related": [
    "IView.GetSplines3"
  ]
}