{
  "frontmatter": {
    "type": "property",
    "interface": "IFeatureManager",
    "member": "EnableFeatureTreeWindow",
    "returns": "System.Boolean",
    "parameters": [],
    "docset": "sldworksapi",
    "deprecated": false,
    "since_version": "unknown",
    "categories": [
      "features"
    ],
    "related": [
      "IFeatureManager.UpdateFeatureTree"
    ],
    "keywords": [
      "featuremanager",
      "design",
      "tree",
      "see",
      "also",
      "ifeaturemanager",
      "ifeatmgrview",
      "interfaces",
      "update",
      "rebuild",
      "enablefeaturetreewindow",
      "feature",
      "manager",
      "enable",
      "window",
      "boolean"
    ],
    "readonly": null
  },
  "title": "IFeatureManager.EnableFeatureTreeWindow",
  "description": "Gets or sets whether the FeatureManager design tree is enabled or not.",
  "signature": "System.Boolean EnableFeatureTreeWindow {get; set;}",
  "parameters": [],
  "returns": "",
  "remarks": "Use this property with\nIFeatureManager::EnableFeatureTree\n, which temporarily enables or disables the FeatureManager design tree update when an add-in is running a series of operations.\nWhile the FeatureManager design tree is disabled and not being updated, the FeatureManager tree may become out of date with what is actually in the model. If an interactive user attempts to interact with the FeatureManager design tree while it is in this out-of-date state, problems could occur. Normally, this should not happen because the add-in should only be disabling the FeatureManager design tree update temporarily and then enabling it immediately after the series of operations complete. However, if there is any possibility that an interactive user could interact with the FeatureManager design tree, then use FeatureManager::EnableFeatureTreeWindow, which prohibits any user interaction with the FeatureManager design tree because the control is disabled.\nJust as with the IFeatureManager::EnableFeatureTree property, this property is meant to be used for temporary disabling. If it is necessary to disable the FeatureManager design tree control, then it should only be disabled while the add-in is performing some series of operations and enabled immediately after these operations complete. Do not to leave the FeatureManager design tree window disabled when control is returned to SOLIDWORKS, i.e., the interactive user.",
  "examples": [],
  "related": [
    "IFeatureManager.UpdateFeatureTree"
  ]
}