{
  "frontmatter": {
    "type": "pattern",
    "title": "Macro Best Practices",
    "keywords": [
      "macro",
      "vba",
      "record",
      "run",
      "debug"
    ],
    "categories": [
      "documents"
    ],
    "related": []
  },
  "title": "Macro Best Practices",
  "body": [
    "## SOLIDWORKS Macros",
    "",
    "- The quickest and easiest way to start programming with the SOLIDWORKS API is to record a SOLIDWORKS macro, which contains the SOLIDWORKS API calls that correspond to the actions performed in the user interface. You can modify the macro in Microsoft Visual Basic for Applications (VBA) or Microsoft Visual Studio Tools for Applications (VSTA) to fit your work site's needs.",
    "- Microsoft VBA is a toolset based on Microsoft Visual Basic for Applications (VBA) and is embedded in SOLIDWORKS . Microsoft VBA lets you record, run, and edit Microsoft VBA macros in SOLIDWORKS. Recorded macros are saved as .swp files.",
    "- Microsoft Visual Studio Tools for Applications (VSTA) is a toolset based on Microsoft VB.NET and C# and is installed with SOLIDWORKS. Microsoft VSTA lets you record, edit, debug, and run VB.NET and C# code with SOLIDWORKS. Recorded Microsoft VSTA macros are saved as Microsoft VB.NET or C# projects. Building or debugging a Microsoft VSTA macro creates an executable file that ends in the filename extension .dll, which can be used by SOLIDWORKS in the same manner as a .swp file. NOTES:",
    "- Typically you would follow these steps to create a SOLIDWORKS API application using SOLIDWORKS macros:",
    "- Plan the user-interface actions before recording them.",
    "- Record the user-interface actions. NOTE: If you are not familiar with recording SOLIDWORKS macros, record the macro a couple of times to eliminate interactive changes to the view such as changing the view orientation, zooming in or out, panning, rotating the model, and so on.",
    "- Edit the macro to delete extra lines of code and explicitly declare and early bind variables.",
    "- Run the macro to test it.",
    "",
    "## Record SOLIDWORKS Macro",
    "",
    "- Click Record\\Pause Macro on the Macro toolbar, or click Tools , Macro , Record .",
    "- Perform the actions that you want to record.",
    "- When you are done recording, click Stop Macro on the Macro toolbar or click Tools , Macro , Stop .",
    "- In the dialog, type a name for the macro in File name , select the type of macro in Save as type , and click Save .",
    "- NOTES:",
    "- SOLIDWORKS 2018 offers Visual Studio Tools for Applications (VSTA) .",
    "- If you selected SW VBA Macros (*.swp) , then the .swp extension is automatically added to the filename.",
    "- If you selected SW VSTA VB Macro (*.vbproj) , then a Visual Basic .NET project is created. Building or debugging the project creates an executable file with an filename extension of .dll .",
    "",
    "## Run SOLIDWORKS Macro",
    "",
    "- Opens a dialog that lets you select the macro that you want to run.",
    "- In the dialog, locate the macro ( .swp or .dll ) file that you want to run and click Open .",
    "- You can also assign SOLIDWORKS macros to toolbar buttons .",
    "",
    "## Edit or Debug SOLIDWORKS Macro",
    "",
    "- Edit or debug SOLIDWORKS macros using Microsoft VBA or Microsoft VSTA.",
    "- NOTES:",
    "- SOLIDWORKS 2018 offers Visual Studio Tools for Applications (VSTA) , impacting how VB.NET and C# macros are developed and run in SOLIDWORKS 2018 and later.",
    "- When debugging Microsoft VSTA macros with user-interface components such as PropertyManager pages, manipulators, or other objects that use events or handler objects, the debugger must continue to run after the main() method of the VSTA macro exits. Either deselect the user-interface system option Stop VSTA debugger on macro exit (located on the Tools > Options > System Options dialog) or set swUserPreferenceToggle_e swStopDebuggingVstaOnExit to false to keep the debugger running after the main() method of the Microsoft VSTA macro exits.",
    "- To automatically edit a macro after recording it, click Tools > Options > Systems Options . On the General tab, select Automatically edit macro after recording and click OK . This setting is persistent across SOLIDWORKS sessions unless you selected to save a just recorded macro as SW All Macros Types (*.swp, *.csproj, *.vbproj) . This setting has no effect when you select to save a macro as multiple macro types.",
    "- If you recently edited the macro, you can select it from the menu when you click Tools > Macro . This menu lists the last nine macros that you edited.",
    "- Click Edit Macro on the Macro toolbar, or click Tools > Macro > Edit .",
    "- In the dialog, select SW VBA Macros (*.swp) in Files of type (selected by default).",
    "",
    "## Assign SOLIDWORKS Macro to Button",
    "",
    "- When you create a SOLIDWORKS macro, you can assign a bitmap to a macro button on a SOLIDWORKS toolbar. The SOLIDWORKS installation includes sample bitmaps, or you can create your own bitmap. If you create a bitmap for a macro button, the bitmap must meet these requirements:",
    "- Dimension = 16 x 16 pixels",
    "- Color = 16 colors",
    "- Background color = white",
    "- With a document open, click Tools > Customize .",
    "- In the dialog box, on the Commands tab:",
    "- Select Macro in Categories .",
    "- Under Buttons , drag the New Macro Button to any toolbar or the CommandManager in SOLIDWORKS.",
    "",
    "## Option Explicit Statement",
    "",
    "- Including the Option Explicit statement at the beginning of a Visual Basic for Applications (VBA) program forces you to declare variables before they are used and assists in detecting errors in your code.",
    "",
    "### Code",
    "",
    "```",
    "'------------------------------------------------------------------------------ ' In the following example, the Option Explicit statement forces you to declare ' swApp and retVal. Additionally, early binding is used when declaring swApp. '------------------------------------------------------------------------------\nOption Explicit\n \nDim swApp As SldWorks.SldWorks\nDim retVal As Long\n \nSub main()\n    Set swApp = Application.SldWorks\n    retVal = swApp.CopyDocument(\"d:\\samples\\hotrod.sldprt\", \"c:\\temp\\hotrod.sldprt\", \"\", \"\", swMoveCopyOptionsOverwriteExistingDocs)\n    Debug.Print retVal\nEnd Sub",
    "```",
    ""
  ]
}